INSERT INTO question (QUESTION_ID, QUESTION)
VALUES 
    ('Q-01', '1. 교수는 수업 전 강의 목표를 명확히 제시하였습니까?'),
    ('Q-02', '2. 강의의 내용은 체계적이고 성의있게 구성되었는가?'),
    ('Q-03', '3. 교수는 강의 내용에 대해 전문적 지식이 있었는가?'),
    ('Q-04', '4. 강의 진행 속도는 적절하였는가?');

INSERT INTO answer (ANSWER_ID, ANSWER)
VALUES
    ('A-01', '(1) 전혀 아니다.'),
    ('A-02', '(2) 아니다.'),
    ('A-03', '(3) 그렇다. '),
    ('A-04', '(4) 매우그렇다.');

INSERT INTO user (USER_NAME, USER_ID)
VALUES
    ('홍길동', 'P-01'),
    ('장길산', 'P-02'),
    ('신사임당', 'P-03'),
    ('이순신', 'P-04');

INSERT INTO survey (SURVEY_ID, USER_ID, QUESTION_ID, ANSWER_ID)
VALUES 
    ('S-01', 'P-01', 'Q-01', 'A-02'),
    ('S-02', 'P-01', 'Q-02', 'A-02'),
    ('S-03', 'P-01', 'Q-03', 'A-03'),
    ('S-04','P-01', 'Q-04', 'A-04'),
    ('S-05', 'P-02', 'Q-01', 'A-02'),
    ('S-06', 'P-02', 'Q-02', 'A-02'),
    ('S-07', 'P-02', 'Q-03', 'A-03'),
    ('S-08', 'P-02', 'Q-04', 'A-04'),
    ('S-09', 'P-03', 'Q-01', 'A-02'),
    ('S-10', 'P-03', 'Q-02', 'A-02'),
    ('S-11', 'P-03', 'Q-03', 'A-03'),
    ('S-12', 'P-03', 'Q-04', 'A-04'),
    ('S-13', 'P-04', 'Q-01', 'A-02'),
    ('S-14', 'P-04', 'Q-02', 'A-02'),
    ('S-15', 'P-04', 'Q-03', 'A-03'),
    ('S-16', 'P-04', 'Q-04', 'A-04');
